[{"name": "Hunter Biden indicted by special counsel on felony gun charges", "url": "https://www.msn.com/en-us/news/politics/hunter-biden-indicted-by-special-counsel-on-felony-gun-charges/ar-AA1gJg3B", "description": "  President Joe Biden's son Hunter Biden has been indicted by special counsel David Weiss on felony gun charges.   The charges bring renewed legal pressure on the younger Biden after a plea agreement", "provider": "ABC News"}, {"name": "'Stepping on dead people': Voices from flood-ravaged Libyan city", "url": "https://www.msn.com/en-us/news/world/stepping-on-dead-people-voices-from-flood-ravaged-libyan-city/ar-AA1gJbKH", "description": "Homes, lives and the heart of a city: The water ripped it all away.Like so many others, construction worker Mohamad Mahmoud Ismail Al-Shalwi rushed home Monday morning to check on his extended family", "provider": "NBC News"}, {"name": "'Threats don’t matter': McCarthy taunts hardline Republicans as government shutdown approaches", "url": "https://www.msn.com/en-us/news/politics/threats-don-t-matter-mccarthy-taunts-hardline-republicans-as-government-shutdown-approaches/ar-AA1gJ6ZT", "description": "             WASHINGTON — The House appears no closer to funding the government and averting a shutdown than they were when lawmakers left over a month ago for a weeks-long August recess.            ", "provider": "USA TODAY"}, {"name": "Arm Shares Rise as Trading Begins in Biggest IPO of the Year", "url": "https://www.msn.com/en-us/money/companies/arm-shares-rise-as-trading-begins-in-biggest-ipo-of-the-year/ar-AA1gIEMq", "description": "Shares of Arm surged in its highly anticipated stock-market debut Thursday, in a sign of the reviving fortunes of an IPO market that has been in the doldrums for most of the past two years.  The", "provider": "The Wall Street Journal"}, {"name": "The US wants to talk to North Korea but doesn't know how", "url": "https://www.msn.com/en-us/news/world/the-us-wants-to-talk-to-north-korea-but-doesnt-know-how/ar-AA1gH9lX", "description": "For decades, the West - and Washington particularly - has asked itself the question: how do you solve a problem like North Korea? Now it may be more urgent than ever as Kim Jong Un and Vladimir", "provider": "BBC"}, {"name": "Wisconsin Justice Department Sues After Lawmakers Fire Top Election Official", "url": "https://www.msn.com/en-us/news/politics/wisconsin-justice-department-sues-after-lawmakers-fire-top-election-official/ar-AA1gJwCz", "description": "Wisconsin’s Republican-controlled legislature voted to oust the state’s top elections official on Thursday, prompting a suit from the state Justice Department that sends the dispute over the", "provider": "The Wall Street Journal"}, {"name": "Jimmy and Rosalynn Carter are 'coming to the end' but together and 'in love,' their grandson shares", "url": "https://www.msn.com/en-us/news/politics/jimmy-and-rosalynn-carter-are-coming-to-the-end-but-together-and-in-love-their-grandson-shares/ar-AA1gJ87q", "description": "             Former President Jimmy Carter and former first lady Rosalynn Carter’s grandson said his grandparents remain together and in love, even as they face health challenges.            ", "provider": "USA TODAY"}, {"name": "Alex Jones spent over $93,000 in July. Sandy Hook families who sued him have yet to see a dime", "url": "https://www.msn.com/en-us/news/us/alex-jones-spent-over-93000-in-july-sandy-hook-families-who-sued-him-have-yet-to-see-a-dime/ar-AA1gInMT", "description": "HARTFORD, Conn. (AP) — As Alex Jones continues telling his Infowars audience about his money problems and pleads for them to buy his products, his own documents show life is not all that bad — his", "provider": "The Associated Press"}, {"name": "Bill Maher says his show ‘Real Time’ to return despite writers strike", "url": "https://www.msn.com/en-us/tv/news/bill-maher-says-his-show-real-time-to-return-despite-writers-strike/ar-AA1gJxVQ", "description": "   More than four months after “Real Time with Bill Maher” went dark, the HBO show’s host said he was bringing it back despite the ongoing Hollywood writers strike, becoming the first late-night show", "provider": "The Washington Post"}, {"name": "Detroit Three strike deadline nears as sides remain far apart", "url": "https://www.msn.com/en-us/money/companies/detroit-three-strike-deadline-nears-as-sides-remain-far-apart/ar-AA1gIHza", "description": "By David Shepardson(Reuters) -   U.S. automakers and union negotiators offered little hope a deal would be reached on Thursday to avoid a midnight walk-off that would be the United Auto Workers'", "provider": "Reuters"}, {"name": "Luxury cruise ship pulled free days after getting stuck off Greenland's coast", "url": "https://www.msn.com/en-us/travel/news/luxury-cruise-ship-pulled-free-days-after-getting-stuck-off-greenlands-coast/ar-AA1gI4Ob", "description": "  A luxury cruise ship carrying 206 people has been pulled free days after it got stuck off the coast of Greenland, authorities said.   The Joint Arctic Command, which is part of Denmark’s defense", "provider": "ABC News"}, {"name": "Americans sharply divided over whether Biden acted wrongly in son's businesses, AP-NORC poll shows", "url": "https://www.msn.com/en-us/news/politics/americans-sharply-divided-over-whether-biden-acted-wrongly-in-sons-businesses-ap-norc-poll-shows/ar-AA1gJ0yj", "description": "WASHINGTON (AP) — About half of Americans say they have little or no confidence that the Justice Department is handling its investigation into Hunter Biden in a fair and nonpartisan way, and 1 in 3", "provider": "The Associated Press"}]